# DuctFittingAndAccessoryPressureDropItem Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryPressureDropItem Class
Members See Also
---
A flow path of the duct/pipe fitting and accessory. It is defined by the begin connector and end connector.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class DuctFittingAndAccessoryPressureDropItem : IDisposable
```

Visual Basic
---
```text
Public Class DuctFittingAndAccessoryPressureDropItem _
	Implements IDisposable
```

Visual C++
---
```text
public ref class DuctFittingAndAccessoryPressureDropItem : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Mechanical..::..DuctFittingAndAccessoryPressureDropItem
# See Also
DuctFittingAndAccessoryPressureDropItem Members
Autodesk.Revit.DB.Mechanical Namespace